# 1. Даны два целых числа А и В (A < B). Вывести в порядке возрастания все целые числа, расположенные между А и В (включая сами числа А и В), а также количество N этих чисел.
try:
    #Ввод чисел A и B
    A = int(input("Введите A: "))
    B = int(input("Введите B: "))

    #Проверяем условие A < B
    if A < B:
        # Вывод всех чисел от A до B
        for i in range(A, B + 1):
            print(i, end=' ')

        #Подсчёт количества чисел
        N = B - A + 1
        print(f"\nКоличество чисел N = {N}")
    else:
        print("Ошибка: должно выполняться условие A < B!")
        
except ValueError:
    print("Ошибка: введите целые числа!")

    
    
